app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    if @event.repeat == "Weekly"
      @event.set_repeat_day
    end
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sxsxasx"], ["description", "xsaxasxa"], ["start_time", "2015-03-15 12:23:00.000000"], ["created_at", "2015-03-15 12:23:14.358683"], ["updated_at", "2015-03-15 12:23:14.358683"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "xsxs"], ["updated_at", "2015-04-06 11:15:00.219347"], ["id", 16]]